glob 모듈의 glob 함수를 사용하면 현재 폴더의 파일 목록을 가져올 수 있다. 예를 들어
import glob files = glob.glob(‘*.py’)
와 같이 코딩을 하면 files라는 변수에 현재 폴더에 있 는 파이썬 파일(확장자가 py인 파일) 목록이 리스트로 저장된다.
또한, os 모듈을 import하여 os.path.getsize(파일명)을 하면 지정한 파일의 크기값을 얻을 수 있다.
현재 폴더에 있는 파이썬 파일 중에서 파일 크기가 500바이트 이상인 파일 목록을 출력하시오.

어떻게 풀까요..

glob 모듈의 glob 함수를 사용하면 현재 폴더의 파일 목록을 가져올 수 있다. 예를 들어
import glob files = glob.glob(‘*.py’)
와 같이 코딩을 하면 files라는 변수에 현재 폴더에 있 는 파이썬 파일(확장자가 py인 파일) 목록이 리스트로 저장된다.
또한, os 모듈을 import하여 os.path.getsize(파일명)을 하면 지정한 파일의 크기값을 얻을 수 있다.
현재 폴더에 있는 파이썬 파일 중에서 파일 크기가 500바이트 이상인 파일 목록을 출력하시오.

어떻게 풀까요..
glob 모듈의 glob 함수를 사용하면 현재 폴더의 파일 목록을 가져올 수 있다. 예를 들어
import glob files = glob.glob(‘*.py’)
와 같이 코딩을 하면 files라는 변수에 현재 폴더에 있 는 파이썬 파일(확장자가 py인 파일) 목록이 리스트로 저장된다.
또한, os 모듈을 import하여 os.path.getsize(파일명)을 하면 지정한 파일의 크기값을 얻을 수 있다.
현재 폴더에 있는 파이썬 파일 중에서 파일 크기가 500바이트 이상인 파일 목록을 출력하시오.

어떻게 풀까요..
glob 모듈의 glob 함수를 사용하면 현재 폴더의 파일 목록을 가져올 수 있다. 예를 들어
import glob files = glob.glob(‘*.py’)
와 같이 코딩을 하면 files라는 변수에 현재 폴더에 있 는 파이썬 파일(확장자가 py인 파일) 목록이 리스트로 저장된다.
또한, os 모듈을 import하여 os.path.getsize(파일명)을 하면 지정한 파일의 크기값을 얻을 수 있다.
현재 폴더에 있는 파이썬 파일 중에서 파일 크기가 500바이트 이상인 파일 목록을 출력하시오.

어떻게 풀까요..

